#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_pet.kv: Refreshing state... [id=kv-tolerant-sawfly]
random_pet.aks: Refreshing state... [id=aks-beloved-wren]
random_string.tf-storage-name: Refreshing state... [id=tmccfvikzuankdqxpfg10ko]
random_pet.private_endpoint: Refreshing state... [id=pep-composed-cattle]
random_string.aks-storage-sandbox: Refreshing state... [id=trb6quqgdjc4o2bgxfvszy3]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-12-23 03:11:57.321401746 +0000 UTC]
azurerm_resource_group.rg-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox]
azurerm_resource_group.rg-tf-state: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state]
azurerm_resource_group.rg-networking: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox]
azurerm_resource_group.rg-keyvault: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-keyvault-sandbox]
azurerm_local_network_gateway.lng_home: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/localNetworkGateways/local-gateway-home-sandbox]
azurerm_public_ip.pip_vnetgw: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/publicIPAddresses/pip-vnetgw-sandbox]
azurerm_public_ip.vip-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/publicIPAddresses/vip-bastion-sandbox]
azurerm_network_security_group.nsg-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/networkSecurityGroups/nsg-default]
azurerm_virtual_network.vnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox]
azurerm_network_security_group.nsg-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/networkSecurityGroups/nsg-bastion-sandbox]
azurerm_storage_account.tf-storage: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-tf-state/providers/Microsoft.Storage/storageAccounts/tmccfvikzuankdqxpfg10ko]
azurerm_key_vault.kv-sandbox: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-keyvault-sandbox/providers/Microsoft.KeyVault/vaults/kv-tolerant-sawfly]
azurerm_storage_account.aks-storage-sandbox: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox/providers/Microsoft.Storage/storageAccounts/trb6quqgdjc4o2bgxfvszy3]
azurerm_subnet.subnet-default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/DefaultSubnet]
azurerm_subnet.subnet-aks: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/AKSSubnet]
azurerm_subnet.subnet-vnetgw: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/GatewaySubnet]
azurerm_subnet.subnet-bastion: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox/subnets/AzureBastionSubnet]
azurerm_virtual_network_gateway.vnetgw_default: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworkGateways/vnetgw-sandbox]
azurerm_kubernetes_cluster.aks-lab: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren]
azurerm_virtual_network_gateway_connection.vng_connection_home: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/connections/onprem]
azurerm_private_endpoint.private_endpoint_test: Refreshing state... [id=/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/privateEndpoints/endpoint-sandbox]
azurerm_storage_share.share-aks-sandbox: Refreshing state... [id=https://trb6quqgdjc4o2bgxfvszy3.file.core.windows.net/sandbox]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks-lab will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks-lab" {
      ~ api_server_authorized_ip_ranges     = [
          + "172.125.57.122",
          - "172.125.57.122/32",
        ]
        id                                  = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-aks-sandbox/providers/Microsoft.ContainerService/managedClusters/aks-beloved-wren"
        name                                = "aks-beloved-wren"
        tags                                = {
            "automation"  = "terraform"
            "environment" = "sandbox"
            "owneralias"  = "sladeedmonds"
        }
        # (22 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # azurerm_private_dns_a_record.dns_a will be created
  + resource "azurerm_private_dns_a_record" "dns_a" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sladeedmonds"
      + records             = [
          + "10.10.1.4",
        ]
      + resource_group_name = "rg-networking-sandbox"
      + ttl                 = 300
      + zone_name           = "privatelink.file.core.windows.net"
    }

  # azurerm_private_dns_zone.private_dns_files will be created
  + resource "azurerm_private_dns_zone" "private_dns_files" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-networking-sandbox"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # azurerm_private_dns_zone_virtual_network_link.vnl_sandbox will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnl_sandbox" {
      + id                    = (known after apply)
      + name                  = "vnl-sandbox"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-networking-sandbox"
      + virtual_network_id    = "/subscriptions/20e74405-3cb4-4012-99dc-1a34bb60f548/resourceGroups/rg-networking-sandbox/providers/Microsoft.Network/virtualNetworks/vnet-sandbox"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @sladeedmonds, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*